In [61]:
import pandas as pd
df=pd.read_excel('book1.xlsx')
df

       name  marks  avg    phno
0   archana     88   90  876543
1  sowjanya    100   99  567890
2    dinesh     10   80  456789
3       abc     34   38  234567
4       xyz     12   65  280498
5     weyin     57   78   37006

In [45]:
df.tail()

       name  marks  avg    phno
1  sowjanya    100   99  567890
2    dinesh     10   80  456789
3       abc     34   38  234567
4       xyz     12   65  280498
5     weyin     57   78   37006

In [20]:
df['marks'].mean()

66.0

In [47]:
df[df.marks>40]

       name  marks  avg    phno
0   archana     88   90  876543
1  sowjanya    100   99  567890
5     weyin     57   78   37006

In [62]:
df.set_index('marks',inplace=True)
df

           name  avg    phno
marks
88      archana   90  876543
100    sowjanya   99  567890
10       dinesh   80  456789
34          abc   38  234567
12          xyz   65  280498
57        weyin   78   37006

In [64]:
df.loc[100]

name    sowjanya
avg           99
phno      567890
Name: 100, dtype: object

In [41]:
d={"food":["pizza","chicken","ice cream"],
  "mobile":["samsung","vivo","iphone"],
  "avengers":["ironman","captain america","hulk"]}
df=pd.DataFrame(d)
df

        food   mobile         avengers
0      pizza  samsung          ironman
1    chicken     vivo  captain america
2  ice cream   iphone             hulk

In [37]:
df.head(2)

       name  marks  avg    phno
0   archana     88   90  876543
1  sowjanya    100   99  567890

In [42]:
df[['food','mobile']]

        food   mobile
0      pizza  samsung
1    chicken     vivo
2  ice cream   iphone

In [43]:
df.describe()

             food   mobile         avengers
count           3        3                3
unique          3        3                3
top     ice cream  samsung  captain america
freq            1        1                1